universities = {
    'Институт естественных наук и математики': {
        'ident': ['727', '747'],
        'directions': [
            '01.00.00 Математика и механика',
            '01.03.01 Математика',
            '01.03.03 Механика и математическое моделирование',
            '01.03.04 Прикладная математика',
            '02.00.00 Компьютерные и информационные науки',
            '02.03.01 Математика и компьютерные науки',
            '02.03.02 Разработка программных продуктов',
            '02.03.03 Математическое обеспечение и администрирование информационных систем',
            '03.00.00 Физика и астрономия',
            '03.03.02 Физика',
            '03.05.02 Фундаментальная и прикладная физика',
            '04.00.00 Химия',
            '04.03.01 Химия',
            '04.03.02 Химическое материаловедение',
            '04.05.01 Фундаментальная и прикладная химия',
            '05.03.04 Гидрометеорология',
            '05.03.06 Экология',
            '06.03.01 Биология',
            '10.05.01 Математические методы защиты информации',
            '21.03.03 Геодезия и дистанционное зондирование',
            '27.03.01 Метрология и метрологическое обеспечение',
            '27.03.05 Управление исследованиями и разработками',
            '28.03.01 Нанотехнологии и микросистемная техника',
            '30.05.01 Медицинская биохимия',
            '30.05.02 Медицинская биофизика',
            '30.05.03 Цифровая медицина и биоинформатика'
        ]
    },

    'Институт новых материалов и технологий': {
        'ident': ['723', '743'],
        'directions': [
            '08.03.01 Производство и применение строительных материалов, изделий и конструкций',
            '09.03.02 Информационные системы и технологии',
            '12.03.02 Оптические технологии и материалы',
            '12.03.05 Лазерные, аддитивные и упрочняющие технологии в машиностроении',
            '15.03.01 Машиностроение',
            '15.03.02 Технологические машины и оборудование',
            '15.03.04 Автоматизация технологических процессов и производств',
            '15.03.05 Конструкторско-технологическое обеспечение машиностроительных производств',
            '15.03.06 Мехатроника и робототехника',
            '15.05.01 Проектирование технологических машин и комплексов',
            '18.03.01 Технология высокотемпературных неметаллических конструкционных и функциональных изделий и наноматериалов',
            '22.03.01 Материаловедение и технологии металлических материалов',
            '22.03.02 Металлургия',
            '23.03.02 Проектирование автомобилей и подъемно-транспортных машин',
            '23.03.03 Техническая эксплуатация автомобилей и подъемно-транспортных машин',
            '23.05.02 Транспортные средства специального назначения',
            '27.03.01 Стандартизация и метрология',
            '29.03.04 Технология изготовления ювелирных изделий'
        ]
    },

    'Институт радиоэлектроники и информационных технологий - РтФ': {
        'ident': ['729', '749'],
        'directions': [
            '09.03.01 Алгоритмы искусственного интеллекта',
            '09.03.01 Информатика и вычислительная техника',
            '09.03.03 Прикладная информатика',
            '09.03.04 Программная инженерия',
            '10.03.01 Безопасность компьютерных систем',
            '10.05.02 Информационная безопасность телекоммуникационных систем',
            '10.05.04 Информационно-аналитические системы безопасности',
            '11.00.00 Электроника, радиотехника и системы связи',
            '11.03.01 Радиотехника',
            '11.03.02 Инфокоммуникационные технологии и системы связи',
            '11.03.03 Конструирование и технология электронных средств',
            '11.05.01 Радиоэлектронные системы и комплексы',
            '27.03.04 Управление в технических системах',
            '29.03.03 Технология полиграфического и упаковочного производства'
        ]
    },

    'Институт строительства и архитектуры': {
        'ident': ['726', '746'],
        'directions': [
            '07.03.01 Архитектура',
            '08.03.01 Строительство зданий, сооружений и развитие территорий',
            '08.05.01 Строительство уникальных зданий и сооружений'
        ]
    },

    'Институт физической культуры, спорта и молодежной политики': {
        'ident': ['724', '744'],
        'directions': [
            '39.03.03 Организация работы с молодежью',
            '43.03.01 Сервис в индустрии спорта и рекреации',
            '43.03.03 Гостиничное дело',
            '49.03.01 Физическая культура',
            '49.03.02 Физическая культура для лиц с отклонениями в состоянии здоровья',
            '49.03.04 Спортивная подготовка в смешанном боевом единоборстве MMA'
        ]
    },

    'Институт фундаментального образования': {
        'ident': ['732', '752'],
        'directions': [
            '20.03.01 Техносферная безопасность',
            '20.05.01 Пожарная безопасность'
        ]
    },

    'Институт экономики и управления': {
        'ident': ['735', '755'],
        'directions': [
            '38.03.01 Мировая экономика и международный бизнес',
            '38.03.01 Прикладная экономика и финансы',
            '38.03.02 Международный и корпоративный менеджмент',
            '38.03.02 Менеджмент в энергетике и высокотехнологичных отраслях',
            '38.03.02 Промышленный менеджмент и инвестиционно-строительный бизнес',
            '38.03.04 Государственное и муниципальное управление',
            '38.03.05 Бизнес-информатика',
            '38.03.06 Маркетинг и логистика в коммерции',
            '38.05.01 Финансово-экономическая безопасность',
            '38.05.01 Экономико-правовое обеспечение экономической безопасности',
            '38.05.02 Таможенное дело',
            '41.03.06 Публичная политика и управление',
            '42.03.01 Реклама и связи с общественностью'
        ]
    },

    'Уральская передовая инженерная школа': {
        'ident': ['736', '756'],
        'directions': [
            '13.03.02 Системный инжиниринг и цифровое проектирование',
            '13.03.03 Системный инжиниринг и цифровое проектирование',
            '15.03.01 Системный инжиниринг и цифровое проектирование',
            '15.03.04 Системный инжиниринг и цифровое проектирование',
            '23.03.02 Системный инжиниринг и цифровое проектирование',
            '27.03.03 Системный анализ и управление',
            '27.03.03 Системный инжиниринг и цифровое проектирование'
        ]
    },

    'Уральский гуманитарный институт': {
        'ident': ['730', '750'],
        'directions': [
            '37.03.01 Психология',
            '37.05.01 Клиническая психология',
            '37.05.02 Психология служебной деятельности',
            '38.03.03 Управление персоналом',
            '39.03.01 Социологические исследования в управлении цифровым обществом',
            '39.03.02 Социальная политика и социальное развитие',
            '41.03.01 Страны и регионы мира: политика, экономика и культура',
            '41.03.04 Технологии управления политическими процессами',
            '41.03.05 Международные отношения и мировая политика',
            '42.03.01 Коммуникативные технологии в рекламе и связях с общественностью',
            '42.03.02 Журналистика',
            '42.03.03 Печатные, электронные и интернет-издания',
            '42.03.04 Телевидение и новые медиа',
            '42.03.05 Медиакоммуникации и мультимедийные технологии',
            '43.03.01 Сервис',
            '43.03.02 Управление процессами на предприятиях туризма и гостеприимства',
            '44.03.01 Методика преподавания иностранных языков',
            '44.03.01 Образовательные технологии и проектирование: история и филология',
            '44.03.01 Русский язык как иностранный: теория и методика обучения',
            '45.03.01 Современные иностранные языки и литература',
            '45.03.01 Филология',
            '45.03.02 Лингвистика в сфере деловых и профессиональных коммуникаций и информационных технологий',
            '45.03.02 Перевод и межкультурная коммуникация',
            '45.03.02 Современный перевод и переводоведение',
            '45.03.03 Фундаментальная и прикладная лингвистика',
            '45.03.04 Интеллектуальные системы в гуманитарной сфере',
            '45.05.01 Лингвистическое обеспечение межгосударственных отношений',
            '46.03.01 История',
            '46.03.02 Информационное и документационное обеспечение управления',
            '46.03.03 Археология и этнология',
            '47.03.01 Философия',
            '47.03.02 Прикладная этика',
            '47.03.03 Религиоведение',
            '51.03.01 Культурология',
            '51.03.03 Социально-культурная деятельность',
            '54.03.01 Дизайн',
            '58.03.01 Востоковедение и африканистика',
            '58.03.01 Китайский язык и китаистика'
        ]
    },

    'Уральский энергетический институт': {
        'ident': ['737', '757'],
        'directions': [
            '13.03.01 Теплоэнергетика и теплотехника',
            '13.03.02 Газотурбинное и электротехническое оборудование компрессорных станций',
            '13.03.02 Электроэнергетика и электротехника',
            '13.03.03 Газовые, паровые турбины и двигатели внутреннего сгорания',
            '13.03.03 Газотурбинное и электротехническое оборудование компрессорных станций',
            '14.05.02 Проектирование и эксплуатация атомных станций'
        ]
    },

    'Физико-технологический институт': {
        'ident': ['731', '751'],
        'directions': [
            '03.03.01 Прикладные математика и физика',
            '09.03.02 Информационные системы в научно-технических и социально-экономических технологиях',
            '11.03.04 Электроника и наноэлектроника',
            '12.03.01 Приборостроение',
            '12.03.04 Биотехнические системы и технологии',
            '14.03.02 Ядерные физика и технологии',
            '14.05.01 Ядерные реакторы и материалы',
            '14.05.04 Электроника и автоматика физических установок',
            '18.03.01 Химическая технология материалов новой техники',
            '18.05.02 Химическая технология материалов современной энергетики',
            '27.03.02 Управление качеством',
            '27.03.05 Инноватика и интеллектуальная собственность',
            '28.03.02 Наноинженерия'
        ]
    },

    'Химико-технологический институт': {
        'ident': ['728', '748'],
        'directions': [
            '18.00.00 Химические технологии',
            '18.03.01 Химическая технология неорганических, органических веществ, природных энергоносителей и лекарственных препаратов',
            '18.03.02 Энерго- и ресурсосберегающие процессы в химической технологии, нефтехимии и биотехнологии',
            '19.03.01 Биотехнология'
        ]
    },

    'Филиал в г. Верхняя Салда': {
        'ident': ['733', '753'],
        'directions': [
            '22.03.02 Металлургия титана'
        ]
    },

    'Филиал в г. Каменск-Уральский': {
        'ident': ['734', '754'],
        'directions': [
            '11.03.01 Радиотехника',
            '15.03.05 Конструкторско-технологическое обеспечение машиностроительных производств',
            '22.03.02 Металлургия'
        ]
    },
      
    'Филиал в г. Нижний Тагил': {
        'ident': ['725', '745'],
        'directions': [
            '08.03.01 Строительство',
            '09.03.02 Информационные системы и технологии',
            '13.03.01 Теплоэнергетика и теплотехника',
            '13.03.02 Электроэнергетика и электротехника',
            '15.03.02 Технологические машины и оборудование',
            '15.03.05 Конструкторско-технологическое обеспечение машиностроительных производств',
            '15.03.06 Мехатроника и робототехника',
            '17.05.01 Боеприпасы и взрыватели',
            '18.03.01 Химическая технология',
            '22.03.02 Металлургия',
            '23.05.02 Транспортные средства специального назначения'
        ]
    },
}